app/views/uni_classes/index.html.erb

        <td><%= link_to 'Destroy', uni_class, method: :delete, data: { confirm: 'Are you sure?' } %></td>
    <% elsif not current_user.classes.include? uni_class %>
---
SELECT "uni_classes".* FROM "uni_classes" WHERE (instructor LIKE '%%') AND (subject LIKE '%Computer Science%')
SELECT 1 AS one FROM "uni_classes" INNER JOIN "users_uni_classes" ON "uni_classes"."id" = "users_uni_classes"."uni_class_id" WHERE "users_uni_classes"."user_id" = 1 AND "uni_classes"."id" = 2 LIMIT 1