app/controllers/students_controller.rb

INSERT INTO "students" ("address", "city", "created_at", "fname", "lname", "major", "state", "student_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def new
    @student = Student.new
    current_user.student = @student
    current_user.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "students" SET "student_id" = 'Larry', "fname" = '', "lname" = '', "major" = '', "address" = '', "city" = '', "state" = '', "updated_at" = '2013-03-14 12:05:18.581661' WHERE "students"."id" = 1
---
  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @student = Student.find(params[:id])

    if not @student.user.nil?
      @student.user.destroy