app/controllers/uni_classes_controller.rb

SELECT "uni_classes".* FROM "uni_classes" WHERE (instructor LIKE '%%') AND (subject LIKE '%Computer Science%')
---
  def index
    @uni_classes = UniClass.search(params)

SELECT "uni_classes".* FROM "uni_classes" WHERE "uni_classes"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "uni_classes".* FROM "uni_classes" INNER JOIN "users_uni_classes" ON "uni_classes"."id" = "users_uni_classes"."uni_class_id" WHERE "users_uni_classes"."user_id" = 1
SELECT 1 AS one FROM "uni_classes" INNER JOIN "users_uni_classes" ON "uni_classes"."id" = "users_uni_classes"."uni_class_id" WHERE "users_uni_classes"."user_id" = 1 AND "uni_classes"."id" = 2 LIMIT 1
INSERT INTO "users_uni_classes" ("user_id", "uni_class_id") VALUES (1, 2)
---
  def register
    uni_class = UniClass.find_by_id(params[:id])
    if (not current_user.classes.include? uni_class)
      current_user.classes << uni_class

DELETE FROM "users_uni_classes" WHERE "users_uni_classes"."user_id" = 1 AND "users_uni_classes"."uni_class_id" IN (2)
SELECT "uni_classes".* FROM "uni_classes" WHERE "uni_classes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def deregister
    current_user.classes.delete(UniClass.find_by_id params[:id])

SELECT "uni_classes".* FROM "uni_classes" WHERE "uni_classes"."id" = ? LIMIT 1  [["id", "search"]]
---
  def show
    @uni_class = UniClass.find(params[:id])

SELECT "uni_classes".* FROM "uni_classes" WHERE "uni_classes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @uni_class = UniClass.find(params[:id])

INSERT INTO "uni_classes" ("code", "created_at", "instructor", "room", "schedule", "subject", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @uni_class = UniClass.new(params[:uni_class])

    respond_to do |format|
      if @uni_class.save

SELECT "uni_classes".* FROM "uni_classes" WHERE "uni_classes"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "uni_classes" SET "code" = '42', "updated_at" = '2013-03-14 12:28:34.941689' WHERE "uni_classes"."id" = 2
---
  def update
    @uni_class = UniClass.find(params[:id])

    respond_to do |format|
      if @uni_class.update_attributes(params[:uni_class])

SELECT "uni_classes".* FROM "uni_classes" WHERE "uni_classes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "uni_classes" WHERE "uni_classes"."id" = ?  [["id", 1]]
---
  def destroy
    @uni_class = UniClass.find(params[:id])
    @uni_class.destroy